{
    "companies": [
      {
        "ticker": "NVDA",
        "name": "NVIDIA",
        "articles": [
          {
            "date": "2024-04-06",
            "url": "https://markets.businessinsider.com/news/stocks/nvidia-stock-price-prediction-artificial-intelligence-gpu-earnings-forecast-rally-2024-4",
            "content": "Nvidia's best days are probably behind it — and the stock's meteoric rise amid the artificial intelligence craze will probably start to stumble this year, according to several Wall Street analysts. That bearishness comes amid a stellar year so far for Nvidia, with the Jensen Huang-led firm crushing earnings estimates quarter after quarter. The company is now worth more than Alphabet and Amazon, and it just dethroned Tesla as the top stock pick among retail investors. But the chipmaker's monster-sized gains could soon come to an end, according to Gil Luria, analyst at DA Davidson. He's calling for as much as a 20% slide in Nvidia stock by the end of the year — joining a handful of other strategists who are skeptical of Nvidia's dizzying stock market valuation. Nvidia is unlikely to keep up its rapid pace of growth, as companies investing in AI are bound to tap out eventually, Luria said, speaking recently to BNN Bloomberg. In a note, he assigned a 'hold' rating to the stock and a price target of $620, the lowest estimate on Wall Street. 'A lot of its big customers … are stocking up on its GPU products,' Luria said, pointing to Nvidia's biggest AI chip buyers, like Microsoft and Amazon. 'But as they get to the capacity that they need to have, they're not going to keep buying this for years to come, which is what current Nvidia estimates imply.' Nvidia is expected to see earnings per share soar to $24.75 for the 12-month period through first quarter 2025, according to Bloomberg data. That's nearly double the adjusted $13 EPS it posted the prior year. DA Davidson also expects demand for Nvidia's products to decline by 2026.'The higher we go this year, the more we're going to fall next year,' Luria warned. Other commentators have cast warnings over Nvidia's sky-high valuation. Deutsche Bank maintained its 'hold' rating on the stock in a recent note, pointing to the already-lofty price of the chipmaker. Analysts assigned a price target of $850 a share, implying a 5% downside from the stock's current levels. 'We remained impressed with NVDA's pace of innovation and continue to view the company as the undisputed AI leader, but also believe this view remains quite well known (see impressive rally ytd) and adequately reflected in its already premium valuation,' analysts at the German bank said in a March 18 note. Nvidia also faces risks from the huge amount of competition in the AI space. No company is close to dominating the market as much as Nvidia has, but other chipmakers like Microsoft and Amazon are certainly 'making a run for it,' according to Brian Colello, an equity strategist at Morningstar. 'The cloud companies might just simply see how much they're spending on Nvidia GPUs and then … try to build these chips in-house to run specific AI workloads, 'Colello told Business Insider in an interview. 'Nvidia has massive operating margins and best-of-breed profitability. So that does give a lot of companies incentives for trying to enter the fray.' Nvidia stock could also get hit if the economy were to enter a slowdown, Colello speculated. If customers like Microsoft pull back on GPU spending, that could spell trouble for Nvidia, given that investors already have high expectations baked into the stock Morningstar assigned a three-star, or a neutral rating, to the stock, with a price target of $910. That implies the stock will trade mostly flat for the rest of the year, with Nvidia shares trading around $900 this week. Nvidia bears are certainly in the minority as the chipmaker continues its rally, with shares up 86% from levels at the start of the year. Investors will have their eye on the firm's upcoming earnings report set to roll out May 22, with expectations for the company to pull $5.13 earnings-per-share, Nasdaq data shows. "
          },
          {
            "date": "2024-03-12",
            "url": "https://www.forbes.com/sites/investor-hub/article/will-nvidia-stock-split-2024/?sh=69af636a49ec",
            "content": "Nvidia (NVDA) shareholders have had a good run, watching their stock double in value twice since 2022. NVDA's skyrocketing stock price has done more than produce solid gains for shareholders and feelings of envy from everyone else. It has left the entire investment community wondering, will Nvidia stock split again? Let's explore that question with a look at Nvidia's split history, potential split catalysts, possible outcomes of a split and the likelihood that NVDA will split in 2024. The Current State Of Nvidia Stock As of March 12, NVDA trades for about $900 per share. The stock has been on an incredible run since the end of 2022, gaining nearly 500% in 14 months. Year to date in 2024, Nvidia is up 82%—and that's after a 5.6% pullback on March 8. The performance flags Nvidia as one of the best stocks in 2024 so far. The force behind that momentum is Nvidia's emergence as an early and profitable leader in artificial intelligence (AI). In its most recent earnings release, Nvidia reported 409% quarter-over-quarter sales growth for the Data Center division that handles its AI products. The growth drove quarterly Data Center revenue to $18.4 billion, which outpaced analysts' lofty expectations. Investors, thrilled to see large-scale monetization in AI, scooped up NVDA shares in the second half of February through early-March. There was a brief reversal on March 8, which was likely profit-taking. Investors may have also been spooked by a Citigroup analyst's report noting that Nvidia's market share had slipped slightly in certain categories.  NVDA's Stock Split History Nvidia stock split history implies a split will come sooner rather than later. The company has split its stock five times since going public in 1999. You can see the details of those transactions in the table below. A table outlining Nvidia (NVDA) stock split history. TABLE DATA SOURCE: MACROTRENDS.NET. Nvidia had been aggressive with its split strategy in the early 2000s—keeping the stock price below $100. After 2007, NVDA remained in the two-digit range until 2016. In December 2018, the stock took off, climbing from about $133 to nearly $800 per share by June 2021. That run-up amounted to 470% total growth in roughly 30 months. That's an impressive spike, but less so when compared to Nvidia's most recent gain of nearly 500% in 14 months. The brain trust at Forbes has run the numbers, conducted the research, and done the analysis to come up with some of the best places for you to make money in 2024. Download Forbes' most popular report, 12 Best Stocks To Buy for 2024. Market Sentiment And Speculation  Companies commonly split their stock to lower the share price. The thinking is that a lower share price makes the stock more attractive to a broader range of investors. That fosters a more dynamic trading environment and promotes the stock's liquidity. Liquidity is attractive to investors because it means trade requests can be fulfilled quickly. This is particularly important to institutional investors that trade at scale.  Market sentiment and speculation become factors when investor optimism drives a stock price higher, to the point a split becomes a consideration. Certainly, investors are excited about AI stocks and Nvidia in particular. That excitement does translate to a higher stock price. But Nvidia has done its part, too. With profitable growth and a dominant market share in AI chips, the company is one of the best tech stocks of 2024. In other words, market sentiment in this case may expedite the need for a split, but it's not the sole factor. Market sentiment will more likely play a bigger role after Nvidia announces a split is coming.  This is because split announcements generate buzz and buzz generates buys. Remember the last Tesla stock split in 2022? The stock rose 8% after the split announcement, which was months ahead of the transaction. When Nvidia decides to split its stock, absent any bad news, investors will drive the stock price higher. Possible Nvidia Stock Split Catalysts The factors that will more directly impact the timing of NVDA's next split are share price, demand growth for AI and accessibility concerns for the stock.  NVDA Stock Price NVDA's price today is higher than it was the last time the stock split in 2021. Analyst price targets on NVDA range from $275 to $1,100, averaging out to a consensus of $829.66. A split is a possibility if the stock levels out to the low-$800s, but it becomes increasingly likely if NVDA stretches up to $1,000 or more. The Future Of Artificial Intelligence Nvidia has given investors a taste of AI-related gains. If the growth and profits story in Nvidia's Data Center continues, investors will remain enthusiastic. That will keep the stock price high enough to warrant a split. If the AI outlook levels out or slows, investors won't be forgiving. Many will move on to other growth stories. The interesting thing is that a stock price reversal could also expedite a split. A bullish leadership team could decide to press on with a split to counter negative investment sentiment. Liquidity And Accessibility NVDA priced at $100 has more potential investors than NVDA priced at $800 or more. The $800 price point is only realistic for investors who buy fractional shares or those who invest at least $1,000 monthly. For context, the average annual salary for adults in the U.S. is $4,948 monthly before taxes. That does not easily support a $1,000 investing budget. If NVDA’s share price rises into the four digits, even fractional share purchases can become less appealing. Fractional brokers allow for trades with as little as $1. A $1 buy on a $1,000 stock equates to 0.001 shares. That sounds far less interesting and motivating than one-tenth of a share that's priced at $100. Nvidia's leadership team has addressed the accessibility question in the past. In its 2021 split announcement, the company cited the need 'to make stock ownership more accessible to investors and employees.' Stop chasing shadows in the market. Forbes' expert analysts have pinpointed the 12 superstars poised to ignite returns in 2024. Don't miss out—download 12 Best Stocks To Buy For 2024 and claim your front-row seat to the coming boom. Potential Stock Split Implications For NVDA Shareholders Mathematically, stock splits are non-events. They should not change a company's value or a shareholder's returns. The split only redistributes value across a different number of shares. A forward split increases the number of shares and reduces the stock price accordingly. Still, splits can affect investor perception, which in turn affects the stock price. Let's look at how that may work in the short and long-term for Nvidia. Short-Term Considerations A split announcement from Nvidia will be well-received by the investment community in the short term. Investors will interpret the news as added confirmation that Nvidia's management team is optimistic. Investors will also assume a lower stock price will increase the pool of prospective shareholders. Those factors will push NVDA higher after the split announcement and in the days leading up to the split. NVDA Stock Long-Term Outlook Longer term, an NVDA split in 2024 will have less importance. There is some research indicating that stocks generally outperform after a split, but Nvidia is something of a special case. Investors have already driven the price and the valuation quite high. They're expecting results. If Nvidia doesn't deliver, the stock price will fall. A split won't prevent, delay or minimize that correction. As it stands today, analysts expect Nvidia to produce 80% sales growth in this fiscal year 2025 and 20% in fiscal year 2026. An image of a coin being shared to represent a stock split. GETTY Will Nvidia Stock Split In 2024? Based on Nvidia's split history and its current price, a 2024 split is likely. Analyst Ken Mahoney, president and CEO of Mahoney Asset Management, agrees, although with a slightly longer timeline. Mahoney recently told Bloomberg News that he predicts Nvidia will split within 12 months.  The split ratio will depend on how the stock performs over the next few months. If NVDA has another standout earnings release that drives the price higher, we could see a six-for-one exchange before year-end. That would give shareholders of record an extra five shares for each one they own on the split date. Bottom Line With a high stock price, good momentum and an optimistic outlook, Nvidia is poised for a stock split in 2024. A split doesn't change the stock's potential for volatility, so do your research to ensure the move is right before you buy. Read Next (H3) Thrift Savings Plan Guide: What You Need To Know Reddit IPO: What To Know Ahead Of March's Planned Launch 5 Best Semiconductor Stocks For 2024 The brain trust at Forbes has run the numbers, conducted the research, and done the analysis to come up with some of the best places for you to make money in 2024. Download Forbes' most popular report, 12 Best Stocks To Buy for 2024."
          },
          {
            "date": "2024-03-30",
            "url": "https://finance.yahoo.com/news/nvidia-stock-amd-stock-wont-122230465.html",
            "content": "Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks *Stock Advisor returns as of April 1, 2024 Parkev Tatevosian, CFA has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool has a disclosure policy. Parkev Tatevosian is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through his link, he will earn some extra money that supports his channel. His opinions remain his own and are unaffected by The Motley Fool. Nvidia Stock and AMD Stock: You Won't Believe My Shocking Conclusion was originally published by The Motley Fool"
          }
        ]
      },
      {
        "ticker": "PLTR",
        "name": "Palantir Technologies",
        "articles": [
          {
            "date": "2024-03-20",
            "url": "https://www.msn.com/en-us/money/markets/bad-news-for-palantir-technologies-inc-stock-this-new-risk-has-been-added/ar-BB1iDv4x",
            "title": "Bad News for Palantir Technologies Inc. Stock: This New Risk Has Been Added",
            "content": "Palantir Technologies Inc. (PLTR) has disclosed a new risk, in the Share Price & Shareholder Rights category. Palantir Technologies Inc.’s recently authorized Share Repurchase Program, which aims to buy back up to $1.0 billion in Class A common stock, carries significant risk with no assured benefit to shareholder value. The decision to repurchase shares hinges on various factors, such as market conditions and corporate needs, which may affect the program’s efficacy. Moreover, the repurchase initiative might inflate stock prices and decrease market liquidity, potentially misaligning with long-term investor interests. Additionally, the redirection of funds from other corporate opportunities to stock buybacks could adversely impact Palantir’s financial flexibility and strategic growth prospects. Overall, Wall Street has a Hold consensus rating on PLTR stock based on 2 Buys, 5 Sells and 6 Holds. In August 2023, our Board of Directors authorized a stock repurchase program of up to $1.0 billion of our outstanding shares of Class A common stock (the 'Share Repurchase Program'). We may repurchase shares of Class A common stock from time to time through open market purchases, in privately negotiated transactions or by other means, including through the use of trading plans intended to qualify under Rule 10b5-1 under the Exchange Act, in accordance with applicable securities laws and other restrictions. The timing and the amount of stock repurchases in the Share Repurchase Program will be determined by Palantir's management, based on its evaluation of factors including business and market conditions, corporate and regulatory requirements, and other considerations. There are a number of ways in which the Share Repurchase Program could fail to result in enhanced shareholder value. For example, any failure to repurchase stock after we have announced our intention to do so may negatively impact our stock price. The existence of the Share Repurchase Program could also cause our stock price to trade higher than it otherwise would and could potentially reduce the market liquidity for our stock. The market price of our common stock could decline below the levels at which we repurchased shares and short-term stock price fluctuations could reduce the effectiveness of this program. Additionally, repurchasing our Class A common stock will reduce the amount of cash, cash equivalents and marketable securities we have available to fund working capital, capital expenditures, capital preserving investments, strategic acquisitions or business opportunities, and other general corporate purposes, and there are no guarantees that the Share Repurchase Program will result in increased shareholder value. Furthermore, the timing and amount of any repurchases, if any, will be subject to liquidity, market and economic conditions, compliance with applicable legal requirements and other relevant factors."
          },
          {
            "date": "2024-03-20",
            "title": "Palantir Technologies Stock (NYSE:PLTR), Analyst Ratings, Price Targets, Predictions",
            "url":"https://www.tipranks.com/stocks/pltr/risk-factors?utm_source=msn.com&utm_medium=referral#google_vignette",
            "content": "Palantir Technologies Inc has a consensus price target of $17.09, established from looking at the 75 latest analyst ratings. The last 3 analyst ratings were released from Monness, Crespi, Hardt, Wedbush, and Mizuho on March 28, 2024, March 8, 2024, and March 7, 2024. With an average price target of $25.33 between Monness, Crespi, Hardt, Wedbush, and Mizuho, there's an implied 24.79% upside for Palantir Technologies Inc from these 3 analyst ratings.The latest price target for Palantir Technologies (NYSE: PLTR) was reported by Monness, Crespi, Hardt on March 28, 2024. The analyst firm set a price target for $20.00 expecting PLTR to fall to within 12 months (a possible -1.48% downside). 33 analyst firms have reported ratings in the last year. The latest analyst rating for Palantir Technologies (NYSE: PLTR) was provided by Monness, Crespi, Hardt, and Palantir Technologies downgraded their sell rating.The last upgrade for Palantir Technologies Inc happened on February 6, 2024 when Citigroup raised their price target to $20. Citigroup previously had a sell for Palantir Technologies Inc."
          },
          {
            "date": "2024-03-30",
            "title": "Palantir Technologies Inc. (PLTR) is Attracting Investor Attention: Here is What You Should Know",
            "url": "https://www.msn.com/en-us/money/topstocks/palantir-technologies-inc-pltr-is-attracting-investor-attention-here-is-what-you-should-know/ar-AA1njbJS",
            "content": "Palantir Technologies Inc. (PLTR) has been one of the most searched-for stocks on Zacks.com lately. So, you might want to look at some of the facts that could shape the stock's performance in the near term. Over the past month, shares of this company have returned -13.7%, compared to the Zacks S&P 500 composite's -2.6% change. During this period, the Zacks Technology Services industry, which Palantir Technologies falls in, has lost 7.1%. The key question now is: What could be the stock's future direction?  Although media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision. Revisions to Earnings Estimat Here at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock. Our analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements. Palantir Technologies is expected to post earnings of $0.08 per share for the current quarter, representing a year-over-year change of +60%. Over the last 30 days, the Zacks Consensus Estimate remained unchanged. For the current fiscal year, the consensus earnings estimate of $0.33 points to a change of +32% from the prior year. Over the last 30 days, this estimate has remained unchanged. For the next fiscal year, the consensus earnings estimate of $0.40 indicates a change of +20.8% from what Palantir Technologies is expected to report a year ago. Over the past month, the estimate has remained unchanged. Having a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Palantir Technologies is rated Zacks Rank #3 (Hold). The chart below shows the evolution of the company's forward 12-month consensus EPS estimate: 12 Month EPS Projected Revenue Growth While earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth. In the case of Palantir Technologies, the consensus sales estimate of $614.88 million for the current quarter points to a year-over-year change of +17.1%. The $2.68 billion and $3.25 billion estimates for the current and next fiscal years indicate changes of +20.6% and +21.3%, respectively. Last Reported Results and Surprise History  Palantir Technologies reported revenues of $608.35 million in the last reported quarter, representing a year-over-year change of +19.6%. EPS of $0.08 for the same period compares with $0.04 a year ago. Compared to the Zacks Consensus Estimate of $603.48 million, the reported revenues represent a surprise of +0.81%. The EPS surprise was 0%. Over the last four quarters, Palantir Technologies surpassed consensus EPS estimates two times. The company topped consensus revenue estimates three times over this period. Valuation Without considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects. Comparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is. As part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued. Palantir Technologies is graded D on this front, indicating that it is trading at a premium to its peers. Click here to see the values of some of the valuation metrics that have driven this grade. Conclusion The facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Palantir Technologies. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term."
          },
          {
            "date": "2024-03-06",
            "title": "Palantir Stock Rises on $178 Million U.S. Army Contract Win",
            "url": "https://www.barrons.com/articles/palantir-stock-army-titan-contract-70a183e5?adobe_mc=MCMID%3D77390209400787617473083191009587576268%7CMCORGID%3DCB68E4BA55144CAA0A4C98A5%2540AdobeOrg%7CTS%3D1713631471",
            "content": "Palantir Technologies stock was climbing after the company won a $178.4 million contract from the U.S. Army for a project known as TITAN, an acronym for Tactical Intelligence Targeting Access Node, mobile ground stations powered by artificial intelligence and machine-learning technology."
          },
          {
            "date": "2024-04-19",
            "title": "Where Will Palantir's Soaring Stock Be in 10 Years?",
            "url": "https://finance.yahoo.com/news/where-palantirs-soaring-stock-10-131500008.html",
            "content": "With shares up almost 150% in the past 12 months, Palantir Technologies (NYSE: PLTR) isn't missing out on the artificial intelligence (AI) boom powering the tech industry right now. But while hardware giants like Nvidia are making most of the early money, software could become increasingly important over the coming decade.Let's discuss what the next 10 years could have in store for the big-data specialist as it seeks to leverage its position in the defense and law enforcement sectors to help introduce this transformational technology.A strong moat and an attractive business modelPalantir is a software-as-a-service (SaaS) company that helps its clients turn big data into actionable insights. The SaaS business model involves providing a continually updated software solution in return for periodic subscription fees. It is particularly attractive for investors because these companies can enjoy consistently recurring and compounding revenue, which makes them easier to scale.Palantir has the added advantage of a close relationship with the U.S. government and its allies. As a start-up, the company was partially funded with the help of the CIA's venture capital arm, In-Q-tel. And many of its employees have security clearances to handle sensitive information. These characteristics create an economic moat around its government contracting business, which generates over 50% of its revenue.The next 10 years could expand Palantir's marketWhile most people hope for a peaceful future, the geopolitical environment is incredibly tense, with flashpoints in Eastern Europe, the Middle East, and East Asia. U.S. allies are beginning to take advantage of AI technology to maintain an edge over their adversaries.Recently, Palantir signed a series of deals with Ukraine to help it with military targeting and de-mining efforts over the next decade. The company has also inked a strategic partnership with Israel to provide AI support for war-related missions. Unsurprisingly, these types of contracts can expose Palantir to potential political and reputational risk.According to CEO Alex Karp, Palantir has lost employees over its leadership's vocal support of Israel, and he expects to lose more. But by embracing this work, Palantir may win opportunities missed by others like Alphabet, which has felt similar pressures. In the end, these issues don't seem to be having a near-term impact on Palantir's ability to gain and retain private-sector corporate clients.Fourth-quarter revenue grew 20% year over year to $608 million, while U.S. commercial revenue grew a whopping 70% to $131 million. Maintaining strong public sector growth could be key to diversifying Palantir's business and maintaining its long-term expansion."
          },
          {
            "date":"2024-04-19",
            "title":"ChatGPT Stock Predictions: 10 Stocks That Have 10X Potential",
            "url":"https://finance.yahoo.com/news/chatgpt-stock-predictions-10-stocks-105638502.html",
            "content":"In this article, we will take a detailed look at ChatGPT Stock Predictions: 10 Stocks That Have 10X Potential. For a quick overview of such stocks, read our article ChatGPT Stock Predictions: 5 Stocks That Have 10X Potential.From taking customer service calls to composing music, AI has already started showing its prowess and impact all over the world. But can AI help investors in spotting potential multibaggers? Several reports show that hedge funds, venture capitalists and wise investors are using AI to their advantage. For example, California-based venture capital firm Sierra Ventures developed an AI software which would help the firm decide whether to invest in a startup. Talking to The Wall Street Journal, the firm's Managing Partner Mark Fernandes said that analysis from this software caused him pay attention to a promising startup that he would have otherwise ignored.If you think about the volume of deals coming in, I wouldve missed that, Fernandes said.How Can AI Help Investors and Professional Stock Pickers?Mike Wilson, Chief U.S. Equity Strategist & Chief Investment Officer at Morgan Stanley, talked to Bloomberg about the impact of AI on businesses and his broader view on the economy. Wilson said that we are still in the early days of AI when it comes to the business world. He said that the 'real opportunity' would be when AI is 'diffused' to the economy and companies begin to adapt to AI technologies.  Wilson said so far the role of AI has been of an assistant rather than an enabler. But the power of AI in the investing world is fast becoming decisive as the technology helps companies make decisions potentially worth billions of dollars.In the investing world, AI has been in action in some form over the past several years, as quant funds and high-performance trading firms rigorously used machine learning for sentiment analysis, finding patterns in stocks and predicting market movements. A research paper titled Artificial Intelligence applied to Stock Market Trading: A Review mentions several studies and academic researches describing the importance of using AI, machine learning and data-based predictive analysis in stock investing. For example, the research mentions a paper which analyzed stock returns when a data mining approach is incorporated where thousands of press releases from companies trading on NYSE and NSADAQ indices were processed.  The data-based analysis divided all press relapses in three categories: Good News, Bad News, and No Movers (for neutral news). The paper found out that good news result in significant stock jumps, while bad news cause stock dips. When this sentiment analysis is practiced, results show a recall of approximately 60% and a better cumulative return and average return per trade than the random trader in a stock market simulation. That's why in a world where data and AI-based analysis is the future, leaving everything to macro movements and randomness won't take an average investor far.AI-based Sentiment Analysis on StocksThe research paper also analyzed another study in which it pulled about 300,000 posts about Apple stock from investing-focused social media platform StockTwits during 2010-2017. Algorithms were then applied to perform sentiment analysis and compare it with historical price movements during this entire period (stock price data was pulled from Yahoo Finance).For sentiment prediction, the achieved test accuracy was 63.5%, 75.3% recall, and 76.8% precision, and for stock movement prediction, the completed test accuracy was 76.68%, 100% recall, and 69.5% precision, the research said.Performance and Returns of AI-Powered Funds and IndexesAmplify Alternative Harvest ETF (NYSEARCA: MJ) is up 18% so far this year, compared to the S&P 500 gain of just 4.5%. The fund, powered by IBM Watson platform, uses sentiment analysis, machine learning and quantum computing to process 10 years of historical data, millions of news articles and data points to analyze securities. Eurekahedge AI Hedge Fund Index, an equally weighted index of 11 constituent funds using artificial intelligence and machine learning theory in their trading processes, is up 3.9% in 2024.MethodologyFor this article we asked ChatGPT to recommend stocks, based on the data as of its knowledge cutoff date, that have the potential to grow 10X in the next few years. Here is our exact prompt:Wear the hat of a stock trader and financial expert and recommend  stocks based on your knowledge that have the potential to 10X in the next few years.As expected, ChatGPT first gave fair warnings that investing in stocks have risks and no one could say with certainty which stocks would grow ten times their current value in the future. But ChatGPT recommended 15 stocks based on  historical trends and the market landscape from various sectors which have substantial potential over the next few years. We have sorted these stocks based on the number of hedge fund investors as of the end of 2023. Some top names in the list include Alphabet Inc  (NASDAQ:GOOG), Nvidia Corp (NASDAQ:NVDA) and Palantir Technologies Inc (NYSE:PLTR).ChatGPT believes Palantir Technologies Incâ€™s (NYSE:PLTR) innovative approach in data analysis could give it a boost in the future. As of the end of the fourth quarter of 2023, 44 hedge funds out of the 933 funds tracked by Insider Monkey had stakes in Palantir Technologies Inc (NYSE:PLTR). The most significant stake in Palantir Technologies Inc (NYSE:PLTR) is owned by D. E. Shaw which had a $356 million stake in Palantir Technologies Inc (NYSE:PLTR).Carillon Scout Mid Cap Fund stated the following regarding Palantir Technologies Inc. (NYSE:PLTR) in its fourth quarter 2023 investor letter:"
          }
        ]
      },
      {
        "name": "Duolingo",
        "ticker": "DUOL",
        "articles": [
          {
            "date": "2024-04-18",
            "title": "Duolingo Joins S&P MidCap 400",
            "url": "https://www.investors.com/news/duolingo-joins-sp-midcap-400/?src=A00220",
            "content":"Duolingo (DUOL) will join the S&P MidCap 400 index, replacing Cable One (CABO), before the open on Monday, April 22, Dow Jones S&P Indices said late Wednesday. Cable One will replace M.D.C. Holdings (MDC) in the S&P SmallCap 600 index. Both Duolingo and Cable One rose overnight.Duolingo is moving directly into the MidCap 400, which means a number of funds that track the index will have to own DUOL stock. Duolingo stock climbed 6% early Thursday signaling a move toward the 50-day moving average.More funds track the S&P SmallCap 600, so CABO stock benefits from the demotion. Cable One rose 2.9% in late trading.Japan's Sekisui House is set to close its takeover of homebuilder MDC."
          },
          {
            "date":"2024-04-19",
            "title": "Duolingo (DUOL) Surges 5.3%: Is This an Indication of Further Gains?",
            "url": "https://finance.yahoo.com/news/duolingo-duol-surges-5-3-131500483.html",
            "content":"Duolingo, Inc. (DUOL) shares soared 5.3% in the last trading session to close at $205.06. The move was backed by solid volume with far more shares changing hands than in a normal session. This compares to the stock's 16.8% loss over the past four weeks.The stock recorded the price increase on an announcement made by the S&P Dow Jones Indices stating that the company would replace Cable One Inc. in the S&P MidCap 400 index before trading starts on Apr 22, 2024.This company is expected to post quarterly earnings of $0.30 per share in its upcoming report, which represents a year-over-year change of +600%. Revenues are expected to be $165.02 million, up 42.7% from the year-ago quarter.While earnings and revenue growth expectations are important in evaluating the potential strength in a stock, empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.For Duolingo, the consensus EPS estimate for the quarter has remained unchanged over the last 30 days. And a stock's price usually doesn't keep moving higher in the absence of any trend in earnings estimate revisions. So, make sure to keep an eye on DUOL going forward to see if this recent jump can turn into more strength down the road.The stock currently carries a Zacks Rank #1 (Strong Buy). You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>Duolingo is a member of the Zacks Technology Services industry. One other stock in the same industry, Ivanhoe Electric (IE), finished the last trading session 1.3% higher at $10.52. IE has returned 19.3% over the past month.For Ivanhoe Electric , the consensus EPS estimate for the upcoming report has remained unchanged over the past month at -$0.34. This represents a change of -187.2% from what the company reported a year ago. Ivanhoe Electric currently has a Zacks Rank of #3 (Hold).Want the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report"
          },
          {
            "date":"2024-04-18",
            "title": "Duolingo, An AI Play Fluent In Profit, Sales Growth, Gets Rating Upgrade",
            "url": "https://finance.yahoo.com/m/b2fe4722-2fdf-388d-99c5-e85548297b2f/duolingo-an-ai-play-fluent.html",
            "content": "Shares of top-ranked online language learning site Duolingo (DUOL) went for a wild ride after it launched its IPO in mid-2021. On a weekly chart it formed a long IPO base. It topped a buy point last fall, surging 21% on Nov. 9 in 400% of its usual volume. It uses AI to make its lessons fun and its stock has soared.On Friday, the Relative Strength (RS) Rating for Duolingo jumped into the 90-plus percentile to 90. It surged up from 80 the day before, topping an important milestone.Duolingo Among Top 10% For Stock PerformanceThe 90 RS Rating shows that Duolingo tops 90% of stocks for price performance this past year. Decades of market research reveals that stocks that go on to make the biggest gains typically have an 80 or better RS Rating as they launch their largest runs.Among its other key ratings Duolingo boasts a best-possible 99 Composite Rating. It earns an OK 81 Earnings Per Share Rating, largely due to poor performance in its early post-IPO days. Look for that to improve based on recent results. Its B- Accumulation/Distribution Rating shows that mutual funds, ETFs and the like are moderately heavy buyers.In terms of fundamentals, Duolingo reversed from an 8-cent loss in the quarter ended March 31, 2023, to a 121% profit gain the following quarter. In the two most recent quarters its EPS rose 115% and an aggressive 174% last quarter, reversing from a 35-cent loss the same quarter a year earlier to a 26-cent profit.Revenue growth for the young company has been robust too, growing 42%, 44%, 43% and 45% last quarter to $151 million.Duolingo uses artificial intelligence animated characters, including its namesake owl, Duo, to interact with language learners. It offers personalized lessons in a variety of spoken and written formats. Additionally, it awards points and students progress through various levels to the 'Diamond' league where they can compete with other advanced students.The Owl Plummets, Then SoarsAfter surging out of the gate in mid-2021 Duolingo dropped to a 60.50 low in May 2022. From there it shot up, and its fast sales and profit growth made it a darling on Wall Street. It hit an all-time high at 245.87 last Dec. 19. It's consolidated recently in sync with the market pullback. Friday afternoon it traded just above 200. See if the stock is able to form a fresh base and break out.Duolingo says on its website it plans to announce its first quarter earnings results the morning of May 8.Duolingo earns the No. 1 rank among its peers in the Computer Software-Education industry group. VirTra (VTSI) and Spotify Technology (SPOT) are also among the group's highest-rated stocks.IBD's unique Relative Strength Rating measures technical performance by using a 1 (worst) to 99 (best) score that indicates how a stock's price action over the trailing 52 weeks matches up against all other stocks in our database."
          },
          {
            "date": "2024-04-18",
            "title": "Why Is Duolingo (DUOL) Stock Soaring Today",
            "url":"https://finance.yahoo.com/news/why-duolingo-duol-stock-soaring-155213962.html",
            "content":"What Happened:Shares of language-learning app Duolingo (NASDAQ:DUOL) jumped 8.5% in the morning session after the S&P Dow Jones Indices announced that the company would join the S&P MidCap 400 index before the start of trading on Monday, April 22, 2024. Being included in the index means that Duolingo will likely be held by many mutual funds and ETFs, which could potentially drive up demand for the stock.We note that while buying of the stock could increase, this development does not change the fundamentals of the company. Revenue growth, expense efficiency, and capital intensity of the business, for instance, are not impacted by index inclusion or exclusion, so this is more of a technical tailwind for the stock.In addition, J.P. Morgan reiterated its Overweight (Buy) rating on Duolingo, adding that 'it has an attractive risk/reward and potential upside for its first-quarter guide and 2024 outlook.'Is now the time to buy Duolingo? Access our full analysis report here, it's free.What is the market telling us:Duolingo's shares are somewhat volatile and over the last year have had 27 moves greater than 5%. In context of that, today's move is indicating the market considers this news meaningful but not something that would fundamentally change its perception of the business.The previous big move we wrote about was 3 days ago, when the company dropped 6.7% after the major indices declined (Nasdaq down -1.70%, S&P 500 down -1.1%, Dow down -0.61%), while yields soared. Geopolitical tension heightened following reports on Saturday, April 13, 2024, that Iran launched drones and missiles at Israel, driving uncertainty about possible disruption to global trade and commerce should the tension escalate. Also, the Census Bureau report revealed March 2024 retail sales rose 0.7% compared to the previous month (ahead of market expectations for a 0.3% increase), suggesting consumption is strong amidst recent inflation concerns.Prior to these reports, market volatility had picked up after the March 2024 CPI (Consumer Price Index - a gauge of the average price consumers pay for goods and services) report revealed inflation came in slightly hotter than expected, adding to fears that the Fed could delay rate cut plans in 2024.As a reminder, the driver of a stock's value is the sum of its future cash flows discounted back to today. With lower interest rates, investors can apply higher valuations to their stocks. No wonder so many in the investment community are optimistic about 2024. We at StockStory remain cautious, as following the crowd can lead to adverse outcomes. During times like this, it's best to own high-quality, cash-flowing companies that can weather the ups and downs of the market.Duolingo is down 2.2% since the beginning of the year, and at $209.83 per share it is trading 13% below its 52-week high of $241.21 from December 2023. Investors who bought $1,000 worth of Duolingo's shares at the IPO in July 2021 would now be looking at an investment worth $1,508.Todayâ€™s young investors likely havenâ€™t read the timeless lessons in Gorilla Game: Picking Winners In High Technology because it was written more than 20 years ago when Microsoft and Apple were first establishing their supremacy. But if we apply the same principles, then enterprise software stocks leveraging their own generative AI capabilities may well be the Gorillas of the future. So, in that spirit, we are excited to present our Special Free Report on a profitable, fast-growing enterprise software stock that is already riding the automation wave and looking to catch the generative AI next."
          },
          {
            "date":"2024-04-18",
            "title": "Duolingo, Inc. (DUOL) Declines More Than Market: Some Information for Investors",
            "url": "https://finance.yahoo.com/news/duolingo-inc-duol-declines-more-215018066.html",
            "content": "The most recent trading session ended with Duolingo, Inc. (DUOL) standing at $194.66, reflecting a -1.77% shift from the previouse trading day's closing. This change lagged the S&P 500's daily loss of 0.58%. At the same time, the Dow lost 0.12%, and the tech-heavy Nasdaq lost 1.15%.Shares of the company have depreciated by 12.77% over the course of the past month, underperforming the Business Services sector's loss of 4.36% and the S&P 500's loss of 1.09%.Analysts and investors alike will be keeping a close eye on the performance of Duolingo, Inc. in its upcoming earnings disclosure. The company's earnings report is set to go public on May 8, 2024. It is anticipated that the company will report an EPS of $0.30, marking a 600% rise compared to the same quarter of the previous year. Meanwhile, the latest consensus estimate predicts the revenue to be $165.02 million, indicating a 42.68% increase compared to the same quarter of the previous year.In terms of the entire fiscal year, the Zacks Consensus Estimates predict earnings of $1.38 per share and a revenue of $724.75 million, indicating changes of +294.29% and +36.46%, respectively, from the former year.It's also important for investors to be aware of any recent modifications to analyst estimates for Duolingo, Inc. These revisions help to show the ever-changing nature of near-term business trends. Consequently, upward revisions in estimates express analysts' positivity towards the company's business operations and its ability to generate profits.Our research shows that these estimate changes are directly correlated with near-term stock prices. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.Ranging from #1 (Strong Buy) to #5 (Strong Sell), the Zacks Rank system has a proven, outside-audited track record of outperformance, with #1 stocks returning an average of +25% annually since 1988. The Zacks Consensus EPS estimate remained stagnant within the past month. At present, Duolingo, Inc. boasts a Zacks Rank of #1 (Strong Buy).Investors should also note Duolingo, Inc.'s current valuation metrics, including its Forward P/E ratio of 144.12. This represents a premium compared to its industry's average Forward P/E of 22.36.The Technology Services industry is part of the Business Services sector. This group has a Zacks Industry Rank of 95, putting it in the top 38% of all 250+ industries.The Zacks Industry Rank gauges the strength of our industry groups by measuring the average Zacks Rank of the individual stocks within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1."
          },
          {
            "date": "2024-04-15",
            "title": "Why Duolingo (DUOL) Stock Is Trading Lower Today",
            "url": "https://finance.yahoo.com/news/why-duolingo-duol-stock-trading-183304157.html",
            "content": "Shares of language-learning app Duolingo (NASDAQ:DUOL) fell 6.7% in the afternoon session as the major indices declined (Nasdaq down -1.70%, S&P 500 down -1.1%, Dow down -0.61%), while yields soared. Geopolitical tension heightened following reports on Saturday, April 13, 2024, that Iran launched drones and missiles at Israel, driving uncertainty about possible disruption to global trade and commerce should the tension escalate. Also, the Census Bureau report revealed March 2024 retail sales rose 0.7% compared to the previous month (ahead of market expectations for a 0.3% increase), suggesting consumption is strong amidst recent inflation concerns.Prior to these reports, market volatility had picked up after the March 2024 CPI (Consumer Price Index - a gauge of the average price consumers pay for goods and services) report revealed inflation came in slightly hotter than expected, adding to fears that the Fed could delay rate cut plans in 2024.As a reminder, the driver of a stock's value is the sum of its future cash flows discounted back to today. With lower interest rates, investors can apply higher valuations to their stocks. No wonder so many in the investment community are optimistic about 2024. We at StockStory remain cautious, as following the crowd can lead to adverse outcomes. During times like this, it's best to own high-quality, cash-flowing companies that can weather the ups and downs of the market.The stock market overreacts to news, and big price drops can present good opportunities to buy high-quality stocks. Is now the time to buy Duolingo? Access our full analysis report here, it's free.What is the market telling us:Duolingo's shares are somewhat volatile and over the last year have had 26 moves greater than 5%. In context of that, today's move is indicating the market considers this news meaningful but not something that would fundamentally change its perception of the business.The biggest move we wrote about over the last year was about 2 months ago, when the stock gained 23.3% on the news that the company reported fourth-quarter results and delivered robust user and revenue growth, leading to a nice beat on bookings. DAU growth accelerated for the 10th quarter in a row to 65% year on year in Q4, while the ratio of DAUs to MAUs improved to 30%, which highlights that engagement is improving.The top line also benefitted from strengths in the company's family plan offering and better-than-expected performance in New Year promotions. Bottom line metrics also came in strong, with adjusted EBITDA, free cash flow, and EPS exceeding expectations, demonstrating the company's ability to balance growth and profitability. Lastly, guidance for the next quarter and the full year were ahead of expectations for both revenue and adjusted EBITDA."
          },
          {
            "date": "2024-04-11",
            "title": "Here is What to Know Beyond Why Duolingo, Inc. (DUOL) is a Trending Stock",
            "url": "https://finance.yahoo.com/news/know-beyond-why-duolingo-inc-130017816.html",
            "content": "Duolingo, Inc. (DUOL) has been one of the most searched-for stocks on Zacks.com lately. So, you might want to look at some of the facts that could shape the stock's performance in the near term.Shares of this company have returned -3.4% over the past month versus the Zacks S&P 500 composite's +0.8% change. The Zacks Technology Services industry, to which Duolingo belongs, has lost 1.6% over this period. Now the key question is: Where could the stock be headed in the near term?While media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.Revisions to Earnings EstimatesHere at Zacks, we prioritize appraising the change in the projection of a company's future earnings over anything else. That's because we believe the present value of its future stream of earnings is what determines the fair value for its stock.Our analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.For the current quarter, Duolingo is expected to post earnings of $0.30 per share, indicating a change of +600% from the year-ago quarter. The Zacks Consensus Estimate remained unchanged over the last 30 days.For the current fiscal year, the consensus earnings estimate of $1.38 points to a change of +294.3% from the prior year. Over the last 30 days, this estimate has remained unchanged.For the next fiscal year, the consensus earnings estimate of $2.43 indicates a change of +76.5% from what Duolingo is expected to report a year ago. Over the past month, the estimate has changed +0.1%.Having a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Duolingo is rated Zacks Rank #1 (Strong Buy).The chart below shows the evolution of the company's forward 12-month consensus EPS estimate:12 Month EPSRevenue Growth ForecastEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.In the case of Duolingo, the consensus sales estimate of $165.02 million for the current quarter points to a year-over-year change of +42.7%. The $724.75 million and $903.34 million estimates for the current and next fiscal years indicate changes of +36.5% and +24.6%, respectively.Last Reported Results and Surprise HistoryDuolingo reported revenues of $150.99 million in the last reported quarter, representing a year-over-year change of +45.4%. EPS of $0.26 for the same period compares with -$0.35 a year ago.Compared to the Zacks Consensus Estimate of $146.98 million, the reported revenues represent a surprise of +2.73%. The EPS surprise was +23.81%.The company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.ValuationNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.While comparing the current values of a company's valuation multiples, such as price-to-earnings (P/E), price-to-sales (P/S) and price-to-cash flow (P/CF), with its own historical values helps determine whether its stock is fairly valued, overvalued, or undervalued, comparing the company relative to its peers on these parameters gives a good sense of the reasonability of the stock's price.The Zacks Value Style Score (part of the Zacks Style Scores system), which pays close attention to both traditional and unconventional valuation metrics to grade stocks from A to F (an An is better than a B; a B is better than a C; and so on), is pretty helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.Duolingo is graded F on this front, indicating that it is trading at a premium to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.Bottom LineThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Duolingo. However, its Zacks Rank #1 does suggest that it may outperform the broader market in the near term."
          },
          {
            "date": "2024-04-11",
            "title": "Duolingo, Inc. (DUOL) Stock Sinks As Market Gains: What You Should Know",
            "url": "https://finance.yahoo.com/news/duolingo-inc-duol-stock-sinks-214518875.html",
            "content": "The most recent trading session ended with Duolingo, Inc. (DUOL) standing at $216.40, reflecting a -0.68% shift from the previouse trading day's closing. The stock's performance was behind the S&P 500's daily gain of 0.74%. Meanwhile, the Dow experienced a drop of 0.01%, and the technology-dominated Nasdaq saw an increase of 1.68%.The company's shares have seen a decrease of 3.41% over the last month, not keeping up with the Business Services sector's loss of 1.98% and the S&P 500's gain of 0.8%.Investors will be eagerly watching for the performance of Duolingo, Inc. in its upcoming earnings disclosure. The company's earnings report is set to be unveiled on May 8, 2024. The company is predicted to post an EPS of $0.30, indicating a 600% growth compared to the equivalent quarter last year. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $165.02 million, up 42.68% from the year-ago period.For the full year, the Zacks Consensus Estimates project earnings of $1.38 per share and a revenue of $724.75 million, demonstrating changes of +294.29% and +36.46%, respectively, from the preceding year.Investors should also take note of any recent adjustments to analyst estimates for Duolingo, Inc. These latest adjustments often mirror the shifting dynamics of short-term business patterns. As a result, upbeat changes in estimates indicate analysts' favorable outlook on the company's business health and profitability.Our research suggests that these changes in estimates have a direct relationship with upcoming stock price performance. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system.The Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has witnessed an unchanged state. Duolingo, Inc. is currently sporting a Zacks Rank of #1 (Strong Buy).In terms of valuation, Duolingo, Inc. is presently being traded at a Forward P/E ratio of 158.46. This represents a premium compared to its industry's average Forward P/E of 24.74.The Technology Services industry is part of the Business Services sector. This industry, currently bearing a Zacks Industry Rank of 94, finds itself in the top 38% echelons of all 250+ industries.The Zacks Industry Rank assesses the strength of our separate industry groups by calculating the average Zacks Rank of the individual stocks contained within the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1."
          },
          {
            "date": "2024-04-18",
            "title": "Here's Why Duolingo Stock Popped Today",
            "url": "https://finance.yahoo.com/news/heres-why-duolingo-stock-popped-145737894.html",
            "content": "Shares of language-learning app Duolingo (NASDAQ: DUOL) popped on Thursday after the stock was added to the S&P MidCap 400 index. As of 10 a.m. ET, Duolingo stock was up 6% but it had been up as much as 12% in earlier trading.Should investors actually care about this?Investors should concern themselves with news regarding Duolingo's business. By contrast, this news has more to do with the stock. Duolingo stock will officially be a member of the S&P MidCap 400 index on Monday. Between now and then, index funds that track this index must buy shares of Duolingo so that the funds accurately reflect the index. This creates buying pressure and partly explains why Duolingo stock is up today.I wouldn't suggest investors read too much into this news since it's not material to Duolingo's business. The company's ability to attract users, grow revenue, and turn a profit is the same regardless of what index it's a member of.What to do nowAll of this said, I wouldn't say that this news is entirely irrelevant for Duolingo investors. Being added to the index is a recognition of its extraordinary financial results since it went public in 2021.In 2023, Duolingo grew revenue by 44% as its user base grew and as many users elected to pay for premium subscriptions. It also turned a real net profit of $16 million, making it one of only a few companies that's high-growth and profitable. And it's cash-rich and debt-free.Duolingo is scheduled to report quarterly financial results on May 8. Investors should look at user growth, operational discipline, and commentary from management regarding newer initiatives such as its other apps for learning. Assuming these areas continue with historical trends, Duolingo stock could keep performing well for investors.Should you invest $1,000 in Duolingo right now?Before you buy stock in Duolingo, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy nowâ€¦ and Duolingo wasnâ€™t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, youâ€™d have $535,597!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*."
          }
        ]
      },
      {
        "name": "Beyond Meat",
        "ticker": "BYND",
        "articles":  [
          {
            "date": "2024-04-18",
            "title": "Beyond Meat’s revamped burger hits shelves",
            "url": "https://finance.yahoo.com/news/beyond-meat-revamped-burger-hits-095903265.html",
            "content": "This story was originally published on Food Dive. To receive daily news and insights, subscribe to our free daily Food Dive newsletter.Dive Brief:Beyond Meat launched its Beyond IV Burger and Beef in grocery stores nationwide on Thursday. This is the companyâ€™s fourth generation of products and its tastiest and most nutritious yet, the company said. The launch follows the expansion of the companyâ€™s portfolio including Beyond Crumbles and Beyond Steak, which are also both certified by the American Heart Associationâ€™s Heart-Check program. I anticipate a significant shift in how consumers perceive Beyond Meat and its offerings. Our latest innovations are poised to be a game changer, especially for those who were previously skeptical about plant-based meats, said Joy Bauer, Beyond Meat nutrition advisor who is also a registered dietitian, in an email to Food Dive.Dive Insight:Plant-based meats have come under fire for having lengthy ingredient lists. This year, some of the big industry players are trying to change that perception through marketing and ingredient lists.Beyond Meat executives told Food Dive in a visit to its headquarters that the company focused on and implemented guidance from nutritionists, dietitians and consumer feedback when it came to reformulating their products.When I initially met with Founder and CEO Ethan Brown, I proposed several substantive changes aimed at enhancing the health profile of their products, said Bauer, â€œThis included substituting coconut and canola oils with heart-healthy avocado oil.Other changes to the plant-based meats which hit shelves today include where the product gets most of its plant protein from, which is now peas, fava beans, brown rice and red lentils instead of pea protein isolate. Premiumization of the product, though, will also mean a higher price tag. But the company believes its customers are willing to pay up for a healthier product. We know that health is the #1 driver to the plant-based meat category, and Beyond Meat is listening to consumers and delivering what theyâ€™re looking for, said Bauer. The category overall is experiencing a shift to cleaner ingredients. Daring, a plant-based chicken company, advertises as having just six ingredients, while Meati uses 95% mushroom root, a cult-favorite ingredient that touts health benefits like improvement in heart health and digestion. Bauer said that in order to determine if a product truly belongs to the better-for-you category, she examines the ingredients themselves, to determine if they are healthy and wholesome. Then, she checks the nutrition facts panel to ensure that there is not an excessive amount of added sugar, saturated fat, or sodium.Beyond Meat is leading the charge, but I expect (and hope) others will follow our lead, she said."
          },
          {
            "date": "2024-04-15",
            "title": "Should Investors Be Concerned About Beyond Meat's Loss of Market Share?",
            "url": "https://finance.yahoo.com/news/investors-concerned-beyond-meats-loss-080000246.html",
            "content": "Beyond Meat (NASDAQ: BYND) went from new industry darling to beaten-down stock over the past few years, and its shares are down a staggering 97% from the high they set soon after the 2019 IPO.The company has been reporting quarter after quarter of declining sales and steep losses, but investors cheered its fourth-quarter earnings report, sending the stock as much as 60% higher. Those gains were short-lived, however, and Beyond Meat is down 25% year to date with a low price-to-sales ratio of 1.2. But even if investors were initially excited about the company's recent progress, there's reason to be concerned about Beyond Meat's future.Beyond Meat might be losing market shareThe meat substitute industry has been growing, and it should continue to do so over the next few years, according to data from Statista.But Q4 2023 marked Beyond Meat's seventh straight quarter of declining revenue. As its top line shrank 18% to $343.3 million for the year, overall industry sales increased 13%.Some of the updates from the quarter that investors liked included price increases and new product launches. Management laid out a plan to generate higher profitability, including cutting $70 million from its operating budget. These actions should help the situation.Buying Beyond Meat stock now is a bet on management's ability to execute its turnaround plan, but success is far from guaranteed. The company's net loss widened from $66.9 million to $155.1 million year over year in the fourth quarter, and it even reported a gross loss with a negative 113.8% gross margin. Excluding non-cash charges, Beyond Meat's gross margin still worsened from the prior-year period.Management is guiding for revenue of $315 million to $345 million this year, meaning 2024 will likely be yet another year Beyond Meat is left behind by the industry.Should you invest $1,000 in Beyond Meat right now?Before you buy stock in Beyond Meat, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy nowâ€¦ and Beyond Meat wasnâ€™t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, youâ€™d have $540,321!*Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than quadrupled the return of S&P 500 since 2002*."
          },
          {
            "date": "2024-04-02",
            "title": "At 50% Off Its High, Is It Time to Buy Beyond Meat Stock?",
            "url": "https://finance.yahoo.com/news/50-off-high-time-buy-131900875.html",
            "content": "Investors have a chance to buy Beyond Meat (NASDAQ: BYND) stock at close to fire-sale prices these days. Yet there's no shortage of reasons for this deep discount, which has shares trading at about half of their recent highs. The plant-based meat specialist was rocked by slumping demand following the pandemic-era sales spike. Consumers in the past year haven't been motivated by big price cuts on its meat substitute products, either. Sales are sinking and losses are mounting.That might not sound like a recipe for positive shareholder returns from here. However, Beyond Meat is seeing growth in some important markets outside of the core U.S. segment. Inventory is down, too. That's good news for a company with unsold vegan foods stacking up in warehouses over the last two years. Getting the inventories down to a more manageable level should make the whole business more efficient.And management is preparing an aggressive restructuring program that could put the company back on a path to profitability starting later in 2024. The current share price reflects lots of pessimism about the business. Against that backdrop, let's look at whether Beyond Meat stock might be a good buy while it trades about 50% below its 52-week highs.Unappetizing resultsThere hasn't been much for investors to celebrate in Beyond Meat's last few quarterly earnings updates. Sure, the pace of sales declines has slowed in recent months. Yet revenue still dropped 18% in fiscal 2023. Consumers aren't snapping up its meat substitute products at grocery stores, and restaurant chains aren't committing to as much volume, either. These sales channels were down 34% and 27% in the U.S. market last year, respectively.The good news is that Beyond Meat is growing outside of the U.S., with especially strong demand in Europe in recent months. The company logged a 20% increase in its international division last year to offset some of the slump in its home market. Inventory levels are way down as well, pointing to the potential for stabilizing earnings ahead.And Beyond Meat is putting the final touches on an aggressive restructuring project. Our 2024 plan includes taking steps to steeply reduce operating expense and cash use, CEO Ethan Brown told investors in late February.Leave it on the shelfThere's just too much risk around this business for most investors to feel comfortable with Beyond Meat's stock in their portfolios, though. The company isn't even profitable on a gross basis, after all. In other words, the cost of products sold exceeds the incoming revenues, and that's before allocating budgets to things like sales and marketing, research and development, or management salaries. Yes, that's partly because of one-time charges related to inventory write-downs. But the company also had to heavily discount its products to keep merchandise moving through the system. It was forced to discontinue other items, like its jerky product, that simply cost too much to manufacture."
          },
          {
            "date": "2024-04-14",
            "title": "3 Reasons to Avoid Beyond Meat Stock Like the Plague",
            "url": "https://finance.yahoo.com/news/3-reasons-avoid-beyond-meat-134500632.html",
            "content": "If a stock price gets low enough, it can be tempting to consider buying some shares. Beyond Meat (NASDAQ: BYND) certainly qualifies as a discounted stock right now. Shares of the plant-based meat specialist are down over 50% in the past year and are 95% below their pandemic-era highs.The business had a market capitalization of $12 billion back in 2021 but is now valued at below $500 million. That's quite a fall for one of the biggest brands in this popular food niche.Don't let that discount tempt you into buying Beyond Meat shares in hopes of seeing a quick rebound, though. Let's look at some good reasons to stay away from this cheap stock for the time being.Not in the driver's seatBeyond Meat can't control its own destiny today. Instead, the business is being pushed around by wider industry forces. New product introductions weren't enough to rejuvenate growth last quarter, for example. Sales declined 23% in its retail segment, which caters to supermarket chains, and slumped 26% in the restaurant division.It's true that Beyond Meat is seeing much stronger demand in its international business. But overall sales were still down 8% last quarter and slumped by 18% for the full 2023 year. The company might return to modest growth in 2024, but only if the U.S. industry niche rebounds. Until then, investors should brace for volatile -- and often negative -- growth results from Beyond Meat.Gross profit slumpBeyond Meat lost money on both a gross and net basis last year. The good news is management slashed costs and cut inventory, which helped protect profits. However, the main problem is that shoppers aren't willing to pay much of a premium at all for plant-based meat products like its Beyond Burgers. Sales volumes declined in 2023 even though the company cut prices on most of its offerings.Admittedly, industry peers are seeing similar pressures. PepsiCo (NASDAQ: PEP) warned investors back in early February that growth rates are slowing down in the consumer packaged foods space. But Pepsi is expecting to continue expanding in 2024 after boosting organic sales by 10% in 2023. It's also on track to widen its profit margin for a second straight year. Beyond Meat is projected to lose money again in 2024 as sales decline for a third consecutive year.Too riskyManagement is working on a restructuring plan, with details to come later in 2024. This plan should include some dramatic cuts to the production footprint, head count, and the company's global growth ambitions.Beyond Meat might also limit the scope of its product introductions to focus on just the most profitable and popular items. Whatever management decides, it is likely that Beyond Meat will have much smaller growth ambitions going forward."
          },
          {
            "date": "2024-04-18",
            "title": "Beyond IV, the Fourth Generation of the Beyond Burger® and Beyond Beef®, Debuts at Grocery Stores Across the U.S. Including at Walmart and Kroger",
            "url": "https://finance.yahoo.com/news/beyond-iv-fourth-generation-beyond-130000321.html",
            "content": "The fourth generation Beyond Burger and Beyond Beef, Beyond Meat's meatiest and most nutritious products yet, debuts at grocery stores nationwide. The new products are the companyâ€™s meatiest, juiciest beef products yet, provide 21g of plant-based protein and are made with avocado oil, which offers heart-healthy monounsaturated fats, and helped lower the saturated fat to just 2g per servingConsumers can find the new Beyond Burger and Beyond Beef, which are rolling out now in U.S. retail, by looking for the new eye-catching gold packagingEL SEGUNDO, Calif., April 18, 2024 (GLOBE NEWSWIRE) -- Beyond Meat, Inc. (NASDAQ: BYND), a leader in plant-based meat, today announced the launch of the fourth generation Beyond BurgerÂ® and Beyond BeefÂ®, the most significant renovation in the companyâ€™s history, at grocery stores nationwide. The new Beyond Burger and Beyond Beef, the companyâ€™s tastiest and most nutritious yet, are an excellent source of protein â€“ 21g per serving â€“ and have just 2g of saturated fat derived from avocado oil, with no cholesterol or added antibiotics or hormones. The productsâ€™ meatier flavor and taste were preferred over the previous version in consumer testing1, and feedback on the new burger overall has been overwhelmingly positive. Additionally, at a recent conference of registered dietitians, 94% of attendees2 said they enjoyed the taste of the new Beyond Burger, viewed it as healthful, and would recommend it.Iâ€™m so excited about the new Beyond Burger and Beef because not only do they taste incredible, but theyâ€™re super nutritious. Beyond Meat has switched to heart-healthy avocado oil, which brings the saturated fat in the burger and beef down to just 2 grams per serving, and theyâ€™ve also reduced the sodium from the previous version and simplified the ingredient list. I feel proud to recommend these products, said Joy Bauer, renowned registered dietitian, #1 NYT bestselling author and Beyond Meat nutrition advisor.Some of the key changes in the new Beyond Burger & Beyond Beef:Made with avocado oil â€“ beloved by the nutrition community for its high levels of heart-healthy monounsaturated fats3, the shift to avocado oil helped reduce the saturated fat in the products by 60% to just 2g per serving (75% less than 80/20 beef)Avocado oilâ€™s smoother, more neutral flavor also allowed Beyond Meat to unlock an even meatier, beefy flavor, and because avocado oil has a higher smoke point, the new beef is designed to sizzle and BBQ even better than beforeIncreased protein to 21g per servingAdded nutrient-dense plant-based ingredients including red lentil and faba bean proteinSimplified the ingredient list, including removing coconut and canola oils20% less sodium vs. the previous version"
          },
          {
            "date": "2024-03-07",
            "title": "Beyond Meat's Biggest Problem Just Got Bigger, and Investors Should Be Paying Attention",
            "url": "https://finance.yahoo.com/news/beyond-meats-biggest-problem-just-121700739.html",
            "content": "Beyond Meat (NASDAQ: BYND) took off like a rocket ship when it reported fourth-quarter 2023 earnings, with the shares gaining roughly 50% in value in a single day. Within a few days, the stock had given back much of that gain, and if you look further back in time, it's still down roughly 95% from its high-water mark in 2019. If you are looking at Beyond Meat, you need to tread very carefully. The good earnings news isn't as good as it may seem at first.Beyond Meat had a strong quarter -- for Beyond MeatTo be completely fair to Beyond Meat, Q4 2023 was, indeed, a good one for the company. It lived up to its self-imposed goal of cutting costs, and it was able to increase volumes in new markets outside the United States. The numbers on the second point were fairly impressive, with retail channel sales in foreign markets up 22.1% in the quarter and 33.7% higher in the food service channel.There are definitely good things going on at this food maker. But the bad news is still material, and that should worry investors. For example, despite the strength of the company's products in foreign markets, overall sales for Beyond Meat fell 7.8% in the final part of 2023. For the full year, sales were down by 18%. That's not particularly good news.One of the negatives is that Beyond Meat had to offer price concessions to support sales. And that weakness was felt across all four of the business segments the company breaks out. While selling more at lower prices isn't a terrible outcome in the company's two foreign segments, it hints that the results may not be quite as strong as they seem at first.Beyond Meat's really big problemThat statement actually leads into the problem that Beyond Meat investors should really be monitoring. Volume fell 22.6% in the domestic retail segment in Q4 and 25.9% in the domestic food service grouping. For the full year, volume was down 33.9% in the domestic retail segment and 26.9% in domestic food service. Both occurred despite the company charging lower per-pound prices, which should have supported volumes.What is most likely happening here is that Beyond Meat's products have gone from being a hot new fad to commonplace. Customers across the board in the domestic market have simply moved on, or back, to other products that they like more (like real meat). It isn't at all shocking that a new product would see a spike in demand that eventually cools off. That's why food makers are constantly trying to bring out new versions of their products in an effort to keep them top of mind with customers. In fact, virtually all consumer staples companies try to do this.But what happens if you only have one basic product and people just aren't excited about it anymore? The answer is that volumes fall dramatically, just like what has happened with Beyond Meat domestically. To the company's credit, it is trying to bring out innovative products, but that has yet to turn the tide.That brings the story to a longer-term issue to which investors need to pay attention. The strong sales results in foreign markets are largely being driven by the novelty of Beyond Meat in those markets. If sales follow the same trends in those markets as they did in the domestic market, Beyond Meat's best news in 2023 could quickly become just more bad news at some point in the not-too-distant future.Beyond Meat is a risky propositionBeyond Meat's management team is trumpeting their successes, which is what you would expect the company to do. Investors, however, should take that good news with a grain of salt. Beyond Meat is still trying to figure out if it has a sustainable business model. At this point, even with the progress on costs and strong foreign sales, the evidence hasn't proven that Beyond Meat has what it takes to survive as a stand-alone company. Investors should tread carefully here.Should you invest $1,000 in Beyond Meat right now?Before you buy stock in Beyond Meat, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy nowâ€¦ and Beyond Meat wasnâ€™t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*."
          },
          {
            "date": "2024-03-28",
            "title": "How Beyond Meat developed an 'unassailable health portfolio': CEO",
            "url": "https://finance.yahoo.com/video/beyond-meat-developed-unassailable-health-211155601.html",
            "content": "Beyond Meat (BYND) recently launched an updated and expanded selection of its Crumbles product line, which has been certified by the American Heart Association's Heart-Check program and the American Diabetes Association's Better Choices for Life program. The new selections are part of the company's efforts to demonstrate its plant-based products' unassailable health benefits.CEO of Beyond Meat Ethan Brown sits down with Yahoo Finance Executive Editor Brian Sozzi to discuss the company's latest health-oriented products and overall market strategy.The company is pushing against the bad rap plant-based foods developed as  highly processed products: What happened is we began to punch a little bit above our weight as we came out of the gate and so there was concern from the incumbent industry around, hey, how do we position this product as something that is unhealthy. And in fact if you look at the way the nutrition community and the medical community has rallied around what we are doing, that's in fact the exact opposite."
          },
          {
            "date": "2024-03-28",
            "title": "Why Beyond Meat Stock Skyrocketed on Wednesday",
            "url": "https://finance.yahoo.com/news/why-beyond-meat-stock-skyrocketed-171347038.html",
            "content": "Shares of Beyond Meat (NASDAQ: BYND) were sizzling on Wednesday, up by as much as 61.2% in early trading. As of 11:42 a.m. ET, the stock was still up by 44.1%.The catalyst that sent the maker of plant-based meat substitutes higher was the fourth-quarter report it delivered Tuesday after the close, which was something of a mixed bag.Mediocre resultsFor the quarter, Beyond Meat's net revenue declined by 7.8% year over year to $73.7 million. The bad news traveled down the income statement, resulting in a net loss of $155.1 million, or a loss per share of $2.40.To put its performance in context, analysts' consensus estimates were calling for revenue of $66.7 million and a loss per share of $0.89. So, while the top line was better than expected, the bottom line was far worse.That said, the results weren't nearly as bad as they look at first glance. Management noted that as a consequence of the company's global operations review (read restructuring), Beyond Meat took one-time, non-cash charges of $95.6 million, including accelerated depreciation and a loss on the sale of fixed assets.As a result of the review, management made the strategic decision to discontinue the Beyond Meat Jerky products, as demand likely wasn't meaty enough.A solid plan for the futureWhile none of that might seem like much of a reason to celebrate, it was management's commentary that helped push the stock higher.CEO Ethan Brown noted that after the 'extensive initiatives to reset the business' over the past 12 to 18 months, the company has a plan to achieve profit growth. Our 2024 plan includes taking steps to steeply reduce operating expense and cash use; pricing actions and the right-sizing of our production footprint, both in support of margin expansion, he said.As a result of these moves, the company expects to cut a minimum of $70 million from its operating budget this year. Additionally, after an extensive review of its prices in the market, Beyond Meat plans to introduce changes to help put it on the path to profitability.Investor enthusiasm for the moves started the stock higher, but it was a short squeeze that really gave it momentum. Roughly 38% of the total shares outstanding had been sold short, helping fuel the stock price surge.Shareholders shouldn't get too excited, as management still needs to execute on its plan for reaching profitability.Should you invest $1,000 in Beyond Meat right now?Before you buy stock in Beyond Meat, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy nowâ€¦ and Beyond Meat wasnâ€™t one of them. The 10 stocks that made the cut could produce monster returns in the coming years."
          },
          {
            "date": "2024-03-28",
            "title": "Beyond Meat Unveils New and Expanded Line of Beyond Crumbles, Now Certified by the American Heart Association’s Heart-Check Program and the American Diabetes Association’s Better Choices for Life Program",
            "url": "https://finance.yahoo.com/news/beyond-meat-unveils-expanded-line-130000009.html",
            "content": "Shares of Beyond Meat (NASDAQ: BYND) were sizzling on Wednesday, up by as much as 61.2% in early trading. As of 11:42 a.m. ET, the stock was still up by 44.1%.The catalyst that sent the maker of plant-based meat substitutes higher was the fourth-quarter report it delivered Tuesday after the close, which was something of a mixed bag.Mediocre resultsFor the quarter, Beyond Meat's net revenue declined by 7.8% year over year to $73.7 million. The bad news traveled down the income statement, resulting in a net loss of $155.1 million, or a loss per share of $2.40.To put its performance in context, analysts' consensus estimates were calling for revenue of $66.7 million and a loss per share of $0.89. So, while the top line was better than expected, the bottom line was far worse.That said, the results weren't nearly as bad as they look at first glance. Management noted that as a consequence of the company's global operations review (read 'restructuring'), Beyond Meat took one-time, non-cash charges of $95.6 million, including accelerated depreciation and a loss on the sale of fixed assets.As a result of the review, management made the strategic decision to discontinue the Beyond Meat Jerky products, as demand likely wasn't meaty enough.A solid plan for the futureWhile none of that might seem like much of a reason to celebrate, it was management's commentary that helped push the stock higher.CEO Ethan Brown noted that after the extensive initiatives to reset the business' over the past 12 to 18 months, the company has a plan to achieve profit growth. 'Our 2024 plan includes taking steps to steeply reduce operating expense and cash use; pricing actions and the right-sizing of our production footprint, both in support of margin expansion,'  he said.As a result of these moves, the company expects to cut a minimum of $70 million from its operating budget this year. Additionally, after an extensive review of its prices in the market, Beyond Meat plans to introduce changes to help put it on the path to profitability.Investor enthusiasm for the moves started the stock higher, but it was a short squeeze that really gave it momentum. Roughly 38% of the total shares outstanding had been sold short, helping fuel the stock price surge.Shareholders shouldn't get too excited, as management still needs to execute on its plan for reaching profitability.Should you invest $1,000 in Beyond Meat right now?Before you buy stock in Beyond Meat, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now and Beyond Meat wasnâ€™t one of them. The 10 stocks that made the cut could produce monster returns in the coming years."
          }
        ]
      },
      {
        "name": "Advanced Micro Devices AMD",
        "ticker": "AMD",
        "articles": [
          {
            "date": "2024-04-05",
            "url": "https://www.msn.com/en-us/money/markets/amd-stock-drops-amid-rate-uncertainty-and-valuation-reassessment-key-level-to-watch/ar-BB1l6dJe",
            "content": "AMD shares dropped more that 8% on Thursday as interest-rate-cautious investors reassess the chipmaker's outlook and valuation. AMD trades at a higher forward earnings multiple than other AI chip stocks, such as Marvell Technology, Intel, Nvidia, and Broadcom. Amid further downside, AMD shares may find buying interest near a key horizontal line connecting the June 2023 swing high and the 200-day moving average. Advanced Micro Devices (AMD) led chip stocks lower Thursday, dropping by more than 8% as uncertainty over interest rate cuts and a reassessment of the chipmaker’s outlook and valuation contributed to a bearish shift in sentiment. The chipmaker’s stock opened the session lower, with selling gaining momentum after Minneapolis Fed President Neel Kashkari said Thursday afternoon that he had previously expected two interest rate cuts in 2024, but none may be needed this year if inflation remains at elevated levels. On Wednesday, Federal Reserve Chairman Jerome Powell said that the central bank needs more proof of easing inflation before it can cut rates. Typically chip stocks, such as AMD, have a heavy reliance on cheap borrowing costs to fund their expensive development costs, making them highly sensitive to interest rate movements.Looking more specifically at AMD, investors may be reassessing the chipmaker’s valuation amid a wave of profit taking to kickstart the second quarter. When reporting earnings in late January, the company missed Wall Street’s current-quarter expectations amid softer PC and CPU chip demand. While AMC said it sees 2024 artificial intelligence (AI) GPU chip sales of $3.5 billion, that forecast came in below some buy-side expectations of $6 billion."
          },
          {
            "date": "2024-03-23",
            "url": "https://www.msn.com/en-us/money/other/amd-stock-is-down-15-from-its-52-week-highs-and-here-s-why-you-should-buy-it/ar-BB1kLtUQ",
            "content": "Advanced Micro Devices (NASDAQ: AMD) stock price hit a 52-week high on March 8, but shares of the chipmaker have pulled back more than 15% since then, even though there has been no notable company-specific development in the interim. Of course, reports that China is reportedly planning to replace chips made by AMD and Intel from Chinese government servers and personal computers (PCs) did weigh briefly on the stock price, but even that shouldn't be a big problem for AMD in the long run. Here's why. Sanctions in China shouldn't be much of a trouble for AMD. AMD reportedly gets 15% of its total revenue from selling its chips to China. So, any sanctions on sales of its chips in that country may have an impact on AMD's financials. However, the dynamics of the semiconductor market are such that even if AMD is unable to sell its chips in China, it will have other avenues to sell them. For instance, sales of both servers and PCs are expected to grow strongly across the globe thanks to the adoption of artificial intelligence (AI). Sales of PCs fell just 2.7% year over year in the fourth quarter of 2023 as compared to the 14% drop for the entire year. The market is set to witness a turnaround in 2024, driven by a new refresh cycle in the enterprise and education markets, as well as the arrival of AI-enabled PCs. Market research firm Canalys estimates that 48 million AI PCs could be shipped this year, accounting for 18% of the overall market. What's more, shipments of AI PCs could grow at an annual rate of 44% through 2028 and account for 70% of the overall market. Canalys also points out that AI PCs are likely to command a 10% to 15% premium as compared to traditional machines."
          }
        ]
      }
    ]
  }