{
    "companies": [
      {
        "ticker": "NVDA",
        "name": "NVIDIA",
        "articles": [
          {
            "date": "2024-04-06",
            "url": "https://markets.businessinsider.com/news/stocks/nvidia-stock-price-prediction-artificial-intelligence-gpu-earnings-forecast-rally-2024-4",
            "content": "Nvidia's best days are probably behind it — and the stock's meteoric rise amid the artificial intelligence craze will probably start to stumble this year, according to several Wall Street analysts. That bearishness comes amid a stellar year so far for Nvidia, with the Jensen Huang-led firm crushing earnings estimates quarter after quarter. The company is now worth more than Alphabet and Amazon, and it just dethroned Tesla as the top stock pick among retail investors. But the chipmaker's monster-sized gains could soon come to an end, according to Gil Luria, analyst at DA Davidson. He's calling for as much as a 20% slide in Nvidia stock by the end of the year — joining a handful of other strategists who are skeptical of Nvidia's dizzying stock market valuation. Nvidia is unlikely to keep up its rapid pace of growth, as companies investing in AI are bound to tap out eventually, Luria said, speaking recently to BNN Bloomberg. In a note, he assigned a 'hold' rating to the stock and a price target of $620, the lowest estimate on Wall Street. 'A lot of its big customers … are stocking up on its GPU products,' Luria said, pointing to Nvidia's biggest AI chip buyers, like Microsoft and Amazon. 'But as they get to the capacity that they need to have, they're not going to keep buying this for years to come, which is what current Nvidia estimates imply.' Nvidia is expected to see earnings per share soar to $24.75 for the 12-month period through first quarter 2025, according to Bloomberg data. That's nearly double the adjusted $13 EPS it posted the prior year. DA Davidson also expects demand for Nvidia's products to decline by 2026.'The higher we go this year, the more we're going to fall next year,' Luria warned. Other commentators have cast warnings over Nvidia's sky-high valuation. Deutsche Bank maintained its 'hold' rating on the stock in a recent note, pointing to the already-lofty price of the chipmaker. Analysts assigned a price target of $850 a share, implying a 5% downside from the stock's current levels. 'We remained impressed with NVDA's pace of innovation and continue to view the company as the undisputed AI leader, but also believe this view remains quite well known (see impressive rally ytd) and adequately reflected in its already premium valuation,' analysts at the German bank said in a March 18 note. Nvidia also faces risks from the huge amount of competition in the AI space. No company is close to dominating the market as much as Nvidia has, but other chipmakers like Microsoft and Amazon are certainly 'making a run for it,' according to Brian Colello, an equity strategist at Morningstar. 'The cloud companies might just simply see how much they're spending on Nvidia GPUs and then … try to build these chips in-house to run specific AI workloads, 'Colello told Business Insider in an interview. 'Nvidia has massive operating margins and best-of-breed profitability. So that does give a lot of companies incentives for trying to enter the fray.' Nvidia stock could also get hit if the economy were to enter a slowdown, Colello speculated. If customers like Microsoft pull back on GPU spending, that could spell trouble for Nvidia, given that investors already have high expectations baked into the stock Morningstar assigned a three-star, or a neutral rating, to the stock, with a price target of $910. That implies the stock will trade mostly flat for the rest of the year, with Nvidia shares trading around $900 this week. Nvidia bears are certainly in the minority as the chipmaker continues its rally, with shares up 86% from levels at the start of the year. Investors will have their eye on the firm's upcoming earnings report set to roll out May 22, with expectations for the company to pull $5.13 earnings-per-share, Nasdaq data shows. "
          },
          {
            "date": "2024-03-12",
            "url": "https://www.forbes.com/sites/investor-hub/article/will-nvidia-stock-split-2024/?sh=69af636a49ec",
            "content": "Nvidia (NVDA) shareholders have had a good run, watching their stock double in value twice since 2022. NVDA's skyrocketing stock price has done more than produce solid gains for shareholders and feelings of envy from everyone else. It has left the entire investment community wondering, will Nvidia stock split again? Let's explore that question with a look at Nvidia's split history, potential split catalysts, possible outcomes of a split and the likelihood that NVDA will split in 2024. The Current State Of Nvidia Stock As of March 12, NVDA trades for about $900 per share. The stock has been on an incredible run since the end of 2022, gaining nearly 500% in 14 months. Year to date in 2024, Nvidia is up 82%—and that's after a 5.6% pullback on March 8. The performance flags Nvidia as one of the best stocks in 2024 so far. The force behind that momentum is Nvidia's emergence as an early and profitable leader in artificial intelligence (AI). In its most recent earnings release, Nvidia reported 409% quarter-over-quarter sales growth for the Data Center division that handles its AI products. The growth drove quarterly Data Center revenue to $18.4 billion, which outpaced analysts' lofty expectations. Investors, thrilled to see large-scale monetization in AI, scooped up NVDA shares in the second half of February through early-March. There was a brief reversal on March 8, which was likely profit-taking. Investors may have also been spooked by a Citigroup analyst's report noting that Nvidia's market share had slipped slightly in certain categories.  NVDA's Stock Split History Nvidia stock split history implies a split will come sooner rather than later. The company has split its stock five times since going public in 1999. You can see the details of those transactions in the table below. A table outlining Nvidia (NVDA) stock split history. TABLE DATA SOURCE: MACROTRENDS.NET. Nvidia had been aggressive with its split strategy in the early 2000s—keeping the stock price below $100. After 2007, NVDA remained in the two-digit range until 2016. In December 2018, the stock took off, climbing from about $133 to nearly $800 per share by June 2021. That run-up amounted to 470% total growth in roughly 30 months. That's an impressive spike, but less so when compared to Nvidia's most recent gain of nearly 500% in 14 months. The brain trust at Forbes has run the numbers, conducted the research, and done the analysis to come up with some of the best places for you to make money in 2024. Download Forbes' most popular report, 12 Best Stocks To Buy for 2024. Market Sentiment And Speculation  Companies commonly split their stock to lower the share price. The thinking is that a lower share price makes the stock more attractive to a broader range of investors. That fosters a more dynamic trading environment and promotes the stock's liquidity. Liquidity is attractive to investors because it means trade requests can be fulfilled quickly. This is particularly important to institutional investors that trade at scale.  Market sentiment and speculation become factors when investor optimism drives a stock price higher, to the point a split becomes a consideration. Certainly, investors are excited about AI stocks and Nvidia in particular. That excitement does translate to a higher stock price. But Nvidia has done its part, too. With profitable growth and a dominant market share in AI chips, the company is one of the best tech stocks of 2024. In other words, market sentiment in this case may expedite the need for a split, but it's not the sole factor. Market sentiment will more likely play a bigger role after Nvidia announces a split is coming.  This is because split announcements generate buzz and buzz generates buys. Remember the last Tesla stock split in 2022? The stock rose 8% after the split announcement, which was months ahead of the transaction. When Nvidia decides to split its stock, absent any bad news, investors will drive the stock price higher. Possible Nvidia Stock Split Catalysts The factors that will more directly impact the timing of NVDA's next split are share price, demand growth for AI and accessibility concerns for the stock.  NVDA Stock Price NVDA's price today is higher than it was the last time the stock split in 2021. Analyst price targets on NVDA range from $275 to $1,100, averaging out to a consensus of $829.66. A split is a possibility if the stock levels out to the low-$800s, but it becomes increasingly likely if NVDA stretches up to $1,000 or more. The Future Of Artificial Intelligence Nvidia has given investors a taste of AI-related gains. If the growth and profits story in Nvidia's Data Center continues, investors will remain enthusiastic. That will keep the stock price high enough to warrant a split. If the AI outlook levels out or slows, investors won't be forgiving. Many will move on to other growth stories. The interesting thing is that a stock price reversal could also expedite a split. A bullish leadership team could decide to press on with a split to counter negative investment sentiment. Liquidity And Accessibility NVDA priced at $100 has more potential investors than NVDA priced at $800 or more. The $800 price point is only realistic for investors who buy fractional shares or those who invest at least $1,000 monthly. For context, the average annual salary for adults in the U.S. is $4,948 monthly before taxes. That does not easily support a $1,000 investing budget. If NVDA’s share price rises into the four digits, even fractional share purchases can become less appealing. Fractional brokers allow for trades with as little as $1. A $1 buy on a $1,000 stock equates to 0.001 shares. That sounds far less interesting and motivating than one-tenth of a share that's priced at $100. Nvidia's leadership team has addressed the accessibility question in the past. In its 2021 split announcement, the company cited the need 'to make stock ownership more accessible to investors and employees.' Stop chasing shadows in the market. Forbes' expert analysts have pinpointed the 12 superstars poised to ignite returns in 2024. Don't miss out—download 12 Best Stocks To Buy For 2024 and claim your front-row seat to the coming boom. Potential Stock Split Implications For NVDA Shareholders Mathematically, stock splits are non-events. They should not change a company's value or a shareholder's returns. The split only redistributes value across a different number of shares. A forward split increases the number of shares and reduces the stock price accordingly. Still, splits can affect investor perception, which in turn affects the stock price. Let's look at how that may work in the short and long-term for Nvidia. Short-Term Considerations A split announcement from Nvidia will be well-received by the investment community in the short term. Investors will interpret the news as added confirmation that Nvidia's management team is optimistic. Investors will also assume a lower stock price will increase the pool of prospective shareholders. Those factors will push NVDA higher after the split announcement and in the days leading up to the split. NVDA Stock Long-Term Outlook Longer term, an NVDA split in 2024 will have less importance. There is some research indicating that stocks generally outperform after a split, but Nvidia is something of a special case. Investors have already driven the price and the valuation quite high. They're expecting results. If Nvidia doesn't deliver, the stock price will fall. A split won't prevent, delay or minimize that correction. As it stands today, analysts expect Nvidia to produce 80% sales growth in this fiscal year 2025 and 20% in fiscal year 2026. An image of a coin being shared to represent a stock split. GETTY Will Nvidia Stock Split In 2024? Based on Nvidia's split history and its current price, a 2024 split is likely. Analyst Ken Mahoney, president and CEO of Mahoney Asset Management, agrees, although with a slightly longer timeline. Mahoney recently told Bloomberg News that he predicts Nvidia will split within 12 months.  The split ratio will depend on how the stock performs over the next few months. If NVDA has another standout earnings release that drives the price higher, we could see a six-for-one exchange before year-end. That would give shareholders of record an extra five shares for each one they own on the split date. Bottom Line With a high stock price, good momentum and an optimistic outlook, Nvidia is poised for a stock split in 2024. A split doesn't change the stock's potential for volatility, so do your research to ensure the move is right before you buy. Read Next (H3) Thrift Savings Plan Guide: What You Need To Know Reddit IPO: What To Know Ahead Of March's Planned Launch 5 Best Semiconductor Stocks For 2024 The brain trust at Forbes has run the numbers, conducted the research, and done the analysis to come up with some of the best places for you to make money in 2024. Download Forbes' most popular report, 12 Best Stocks To Buy for 2024."
          },
          {
            "date": "2024-03-30",
            "url": "https://finance.yahoo.com/news/nvidia-stock-amd-stock-wont-122230465.html",
            "content": "Should you invest $1,000 in Nvidia right now? Before you buy stock in Nvidia, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Stock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.See the 10 stocks *Stock Advisor returns as of April 1, 2024 Parkev Tatevosian, CFA has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices and Nvidia. The Motley Fool has a disclosure policy. Parkev Tatevosian is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through his link, he will earn some extra money that supports his channel. His opinions remain his own and are unaffected by The Motley Fool. Nvidia Stock and AMD Stock: You Won't Believe My Shocking Conclusion was originally published by The Motley Fool"
          }
        ]
      },
      {
        "name": "Advanced Micro Devices AMD",
        "ticker": "AMD",
        "articles": [
          {
            "date": "2024-04-05",
            "url": "https://www.msn.com/en-us/money/markets/amd-stock-drops-amid-rate-uncertainty-and-valuation-reassessment-key-level-to-watch/ar-BB1l6dJe",
            "content": "AMD shares dropped more that 8% on Thursday as interest-rate-cautious investors reassess the chipmaker's outlook and valuation. AMD trades at a higher forward earnings multiple than other AI chip stocks, such as Marvell Technology, Intel, Nvidia, and Broadcom. Amid further downside, AMD shares may find buying interest near a key horizontal line connecting the June 2023 swing high and the 200-day moving average. Advanced Micro Devices (AMD) led chip stocks lower Thursday, dropping by more than 8% as uncertainty over interest rate cuts and a reassessment of the chipmaker’s outlook and valuation contributed to a bearish shift in sentiment. The chipmaker’s stock opened the session lower, with selling gaining momentum after Minneapolis Fed President Neel Kashkari said Thursday afternoon that he had previously expected two interest rate cuts in 2024, but none may be needed this year if inflation remains at elevated levels. On Wednesday, Federal Reserve Chairman Jerome Powell said that the central bank needs more proof of easing inflation before it can cut rates. Typically chip stocks, such as AMD, have a heavy reliance on cheap borrowing costs to fund their expensive development costs, making them highly sensitive to interest rate movements.Looking more specifically at AMD, investors may be reassessing the chipmaker’s valuation amid a wave of profit taking to kickstart the second quarter. When reporting earnings in late January, the company missed Wall Street’s current-quarter expectations amid softer PC and CPU chip demand. While AMC said it sees 2024 artificial intelligence (AI) GPU chip sales of $3.5 billion, that forecast came in below some buy-side expectations of $6 billion."
          },
          {
            "date": "2024-03-23",
            "url": "https://www.msn.com/en-us/money/other/amd-stock-is-down-15-from-its-52-week-highs-and-here-s-why-you-should-buy-it/ar-BB1kLtUQ",
            "content": "Advanced Micro Devices (NASDAQ: AMD) stock price hit a 52-week high on March 8, but shares of the chipmaker have pulled back more than 15% since then, even though there has been no notable company-specific development in the interim. Of course, reports that China is reportedly planning to replace chips made by AMD and Intel from Chinese government servers and personal computers (PCs) did weigh briefly on the stock price, but even that shouldn't be a big problem for AMD in the long run. Here's why. Sanctions in China shouldn't be much of a trouble for AMD. AMD reportedly gets 15% of its total revenue from selling its chips to China. So, any sanctions on sales of its chips in that country may have an impact on AMD's financials. However, the dynamics of the semiconductor market are such that even if AMD is unable to sell its chips in China, it will have other avenues to sell them. For instance, sales of both servers and PCs are expected to grow strongly across the globe thanks to the adoption of artificial intelligence (AI). Sales of PCs fell just 2.7% year over year in the fourth quarter of 2023 as compared to the 14% drop for the entire year. The market is set to witness a turnaround in 2024, driven by a new refresh cycle in the enterprise and education markets, as well as the arrival of AI-enabled PCs. Market research firm Canalys estimates that 48 million AI PCs could be shipped this year, accounting for 18% of the overall market. What's more, shipments of AI PCs could grow at an annual rate of 44% through 2028 and account for 70% of the overall market. Canalys also points out that AI PCs are likely to command a 10% to 15% premium as compared to traditional machines."
          }
        ]
      }
    ]
  }